In [2]:
import pandas as pd

In [4]:
#empty dataframe
jk=pd.DataFrame()
jk

Empty DataFrame
Columns: []
Index: []

In [5]:
#dataframe using list
li=[[1,2,3],[4,5,6],[7,8,9]]
sk=pd.DataFrame(li)
sk

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
#dataframe using numpy
import numpy as np
n=np.array([(1,10,11),(44,56,65),(73,84,96)])
g=pd.DataFrame(n)
g

    0   1   2
0   1  10  11
1  44  56  65
2  73  84  96

In [10]:
#convert numpy array to dataframe of a given shape
p=np.random.randint(0,10,size=(5,5))
t=pd.DataFrame(p)
t

   0  1  2  3  4
0  9  7  5  3  9
1  7  9  6  2  4
2  3  2  1  1  1
3  8  2  9  5  7
4  2  1  7  5  7

In [25]:
#Create DataFrame using Dictionary with list and array

di={
    'Roll':np.arange(1,6),
    'Name':['sachin','kunal','virat','ab','siraj'],
    'Age':np.random.randint(20,35,5),
    'city':['shirpur','nagpur','delhi','jaipur','mumbai']
}
r=pd.DataFrame(di)
r

   Roll    Name  Age     city
0     1  sachin   20  shirpur
1     2   kunal   33   nagpur
2     3   virat   23    delhi
3     4      ab   30   jaipur
4     5   siraj   20   mumbai